src/CF/Catalogs/СредстваПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>СредстваПредприятия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Локации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/InformationRegisters/ЗначенияНаДругихЯзыках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНаДругихЯзыках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектБазыДанных</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Enums/ТипыДополнительныхРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыДополнительныхРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СсылкаНаЭлементСправочника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеИзСправочника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/ДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ДополнительныеРеквизиты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоРеквизитДляОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыДляДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбъектаВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДополнительногоРеквизита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКлючУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеПараметрыЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/СредстваПредприятия/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// sza150114-0516
// sza140710-1901  локация
// sza140420-0453  
// sza140120-1620  
Процедура ВидимостьОтветственности()
	Элементы.Ответственность.Видимость = ЗначениеЗаполнено(Объект.Ссылка) 
	И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСредствПредприятия") 
	И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗарплатыСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияВидИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ТипВладельца", ДопИнфоТипВладельца);
	ФормаВыбораВидаИнформации = ПолучитьФорму("Справочник.ДополнительныеРеквизиты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	ВидИнформации = ФормаВыбораВидаИнформации.ОткрытьМодально();
	Если ЗначениеЗаполнено(ВидИнформации) Тогда
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.ВидИнформации = ВидИнформации;
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.Информация = ОбщийМодульКлиент.ПолучитьЗначениеПоУмолчаниюПоляДополнительнойИнформации(ВидИнформации);
		СтандартнаяОбработка = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияПриИзменении(Элемент)
	ДопИнформацияИзменена = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.Наименование = Наименование;
	НаименованиеИзменяли = ИСТИНА;
	
	Если ПереводитьНаименованияАвтоматически Тогда
		ОбщийМодульКлиент.ПеревестиНаименованияАвтоматически(Наименование, НаименованияНаДругихЯзыках);
		БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахНаЯзыкеПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ТекущаяСтраница = Элементы.ГруппаСтраниц.ТекущаяСтраница;
	СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
	СтраницаПанели  = СтраницыПанели.Индекс(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ВидимостьОтветственности();
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПоддержкаДругихЯзыков тогда
		Если НаименованиеИзменяли тогда
			ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, Наименование);
		КонецЕсли;
		
		Если БылиИзмененияЗначенияПолейНаЯзыках Тогда
			Для Каждого СтрокаЯзыка Из НаименованияНаДругихЯзыках Цикл
				ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, СтрокаЯзыка.НаЯзыке, "Наименование", СтрокаЯзыка.Язык);	
			КонецЦикла;
			ОбновитьПовторноИспользуемыеЗначения();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДопИнформацияИзменена Тогда
		ОбщийМодульСервисСервер.ЗаписатьДополнительнуюИнформацию(Объект.Ссылка, ДополнительнаяИнформация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНаДругихЯзыках(Команда)
	Элементы.НаименованияНаДругихЯзыках.Видимость  = НЕ Элементы.НаименованияНаДругихЯзыках.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, ИСТИНА);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(СтраницаПанели)Тогда
			
			попытка
				СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
				ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели);
				Элементы.ГруппаСтраниц.ТекущаяСтраница = ТекущаяСтраница;
			исключение
			конецпопытки;	
		КонецЕсли;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.Наименование;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001600", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОбъектСсылка = Объект.Ссылка;
		ЗначениеЗаполненоОбъектСсылка = ЗначениеЗаполнено(ОбъектСсылка);
		
		Если НЕ ЗначениеЗаполненоОбъектСсылка Тогда
			ОбновитьДополнительныеРеквизиты(ИСТИНА);
		Иначе
			ОбновитьДополнительныеРеквизиты();
		КонецЕсли;
		
		ДопИнфоТипВладельца = ОбщийМодульПовтор.ПолучитьТипВладельца(ОбъектСсылка); 	
		ОбщийМодульСервисСервер.ЗаполнитьДополнительнуюИнформацию(ОбъектСсылка, ДополнительнаяИнформация, ДопИнфоТипВладельца);
		
		ПоддержкаДругихЯзыков = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьИныеЯзыкиКромеРусского") 
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", ИСТИНА);
		
		Если ПоддержкаДругихЯзыков 
			И ЗначениеЗаполнено(ОбъектСсылка) Тогда
			
			Наименование = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(объектСсылка);
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ЗначенияНаДругихЯзыках.Язык,
			|	ЗначенияНаДругихЯзыках.НаЯзыке,
			|	ЗначенияНаДругихЯзыках.Поле
			|ИЗ РегистрСведений.ЗначенияНаДругихЯзыках КАК ЗначенияНаДругихЯзыках
			|ГДЕ ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных";
			
			Запрос.УстановитьПараметр("ОбъектБазыДанных", ОбъектСсылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.Поле = "Наименование" Тогда
						СтрокаЯзыка = НаименованияНаДругихЯзыках.Добавить();
						СтрокаЯзыка.Язык 	= ВыборкаДетальныеЗаписи.Язык;
						СтрокаЯзыка.НаЯзыке = ВыборкаДетальныеЗаписи.НаЯзыке;	
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			Наименование = Объект.Наименование;			
		КонецЕсли;	
		
		Если ПоддержкаДругихЯзыков Тогда
			ПереводитьНаименованияАвтоматически = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегистрТекстовНаДругихЯзыкахДляАвтоматическогоПереводаНаименований");
			Элементы.НаименованияНаДругихЯзыкахЯзык.РежимВыбораИзСписка = ИСТИНА;
			ОбщийМодульПовтор.УстановитьСписокДоступныхЯзыков(Элементы.НаименованияНаДругихЯзыкахЯзык.СписокВыбора, ИСТИНА);
		КонецЕсли;
		
		Ответственность.Параметры.УстановитьЗначениеПараметра("Средство", ОбъектСсылка);
		ВидимостьОтветственности();	
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегионыДляУчетаСтранАЛокацииГородов") Тогда
			Элементы.Регион.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Страна");
			Элементы.Локация.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Город");
		КонецЕсли;         	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНаименование(Команда)
	Объект.НаименованиеДляПечати = Объект.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура ВидСредстваПриИзменении(Элемент)
	ВидСредстваПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидСредстваПриИзмененииНаСервере(Знач ПриОткрытии = ЛОЖЬ)
	
	Если НЕ ПриОткрытии Тогда
		ОбновитьДополнительныеРеквизиты(ИСТИНА);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДополнительныеРеквизиты(Знач НоваяВидСредства = ЛОЖЬ)
	
	Счетчик = 1;
	Если ЗначениеЗаполнено(Объект.ВидСредства) Тогда
		
		НаименованияДополнительныхРеквизитов = ОбщийМодульПовтор.ПолучитьДополнительныеРеквизитыВидаСредств(Объект.ВидСредства);
		Если НЕ НаименованияДополнительныхРеквизитов = Неопределено Тогда
			
			Для Каждого ДопРеквизит Из НаименованияДополнительныхРеквизитов Цикл
				
				Если Счетчик <= 10 Тогда
					
					ДополнительныйРеквизит = ДопРеквизит.ДополнительныйРеквизит;
					НаименованиеДопРеквизита = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(ДополнительныйРеквизит);
					
					Выполнить(" ДопРеквизитВида" + СокрЛП(Счетчик) + " = ДопРеквизит.ДополнительныйРеквизит;");
					
					Выполнить(" Элементы.РеквизитВида" + СокрЛП(Счетчик) + ".Видимость = ИСТИНА;");
					Выполнить(" Элементы.РеквизитВида" + СокрЛП(Счетчик) + ".Заголовок = """ + НаименованиеДопРеквизита + """;");
					Выполнить(" Элементы.РеквизитВида" + СокрЛП(Счетчик) + ".Подсказка = """ + НаименованиеДопРеквизита + """;");
					
					Если ДополнительныйРеквизит.ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.ЗначениеИзСправочника")
						ИЛИ ДополнительныйРеквизит.ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника")
						ИЛИ ДополнительныйРеквизит.ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
						
						Выполнить(" Элементы.РеквизитВида" + СокрЛП(Счетчик) + ".КнопкаВыбора  = ИСТИНА;");
						Выполнить(" Элементы.РеквизитВида" + СокрЛП(Счетчик) + ".КнопкаОчистки = ИСТИНА;");
					КонецЕсли;
					
					ТипЗначенияРеквизитаВида = Неопределено;
					Выполнить(" ТипЗначенияРеквизитаВида = ТипЗнч(Объект.РеквизитВида" + СокрЛП(Счетчик) + ");");
					
					Если ТипЗначенияРеквизитаВида = Тип("Дата")
						ИЛИ ТипЗначенияРеквизитаВида = Тип("Булево")
						ИЛИ ТипЗначенияРеквизитаВида = Тип("Число") Тогда
						
						Выполнить(" Элементы.РеквизитВида" + СокрЛП(Счетчик) + ".РастягиватьПоГоризонтали = ЛОЖЬ;");
					КонецЕсли;
					
					Если НоваяВидСредства 
						И НЕ ТипЗначенияРеквизитаВида = ТипЗнч(ДопРеквизит.ЗначениеПоУмолчанию)  Тогда
						
						Выполнить(" Объект.РеквизитВида" + СокрЛП(Счетчик) + " = ДопРеквизит.ЗначениеПоУмолчанию;");
					КонецЕсли;	
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
			КонецЦикла;	
		КонецЕсли;
		
		Пока счетчик <= 10 Цикл
			Выполнить(" Элементы.РеквизитВида" + СокрЛП(Счетчик) + ".Видимость = ЛОЖЬ;");
			
			Если НоваяВидСредства Тогда
				Выполнить(" Объект.РеквизитВида" + СокрЛП(Счетчик) + " = Неопределено;");
			КонецЕсли;
			
			счетчик = счетчик + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("1", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида1Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("1", СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДопРеквизитаНГ(Знач НомерДопРеквизита = "1", СтандартнаяОбработка)	
	
	ТипДополнительногоРеквизита = Неопределено;
	Выполнить(" ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(ДопРеквизитВида" + НомерДопРеквизита + ", ""ТипДополнительногоРеквизита"");");
	
	Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника") Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		
		РеквизитВида = Неопределено;
		Выполнить(" РеквизитВида = Объект.РеквизитВида" + НомерДопРеквизита + ";");
		Если РеквизитВида = Неопределено Тогда
			ТипРеквизита = Неопределено;

			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ОбработатьВыборДопРеквизитаНГЗавершение1", ЭтаФорма, Новый Структура("НомерДопРеквизита, ТипДополнительногоРеквизита", НомерДопРеквизита, ТипДополнительногоРеквизита)), ОбщийМодульКлиент.ПолучитьСписокИзМетаданных(ИСТИНА));
            Возврат;
		КонецЕсли;
		ОбработатьВыборДопРеквизитаНГФрагмент1(НомерДопРеквизита);

		
	ИначеЕсли ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		
		РеквизитВида = Неопределено;
		Выполнить(" РеквизитВида = Объект.РеквизитВида" + НомерДопРеквизита + ";");
		Если РеквизитВида = Неопределено Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ОбработатьВыборДопРеквизитаНГЗавершение", ЭтаФорма, Новый Структура("НомерДопРеквизита, ТипДополнительногоРеквизита", НомерДопРеквизита, ТипДополнительногоРеквизита)), ОбщийМодульКлиент.ПолучитьСписокИзМетаданных(ЛОЖЬ));
            Возврат;
		КонецЕсли;
		ОбработатьВыборДопРеквизитаНГФрагмент(НомерДопРеквизита);

		
	ИначеЕсли ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.ЗначениеИзСправочника")
		И Объект["РеквизитВида" + НомерДопРеквизита] = Неопределено Тогда
		
		СтандартнаяОбработка = ЛОЖЬ;
		
		Объект["РеквизитВида" + НомерДопРеквизита] = ПредопределенноеЗначение("Справочник.НаборЗначенийДополнительныхРеквизитов.ПустаяСсылка");
		ПараметрыФормы = Новый Структура;
		Выполнить(" ПараметрыФормы.Вставить(""Владелец"", РеквизитВида" + НомерДопРеквизита + ");");
		ФормаВыбора = ПолучитьФорму("Справочник.НаборЗначенийДополнительныхРеквизитов.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		ФормаВыбора.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ":";
		
		Объект["РеквизитВида" + НомерДопРеквизита] = ФормаВыбора.ОткрытьМодально();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДопРеквизитаНГЗавершение1(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	НомерДопРеквизита = ДополнительныеПараметры.НомерДопРеквизита;
	ТипДополнительногоРеквизита = ДополнительныеПараметры.ТипДополнительногоРеквизита;	
	
	ТипРеквизита = ВыбранныйЭлемент;
	Если НЕ ТипРеквизита = Неопределено Тогда
		Выполнить(" Объект.РеквизитВида" + НомерДопРеквизита + " = ПредопределенноеЗначение(""Справочник."" + ТипРеквизита.Значение + "".ПустаяСсылка"");");	
	КонецЕсли;
	
	ОбработатьВыборДопРеквизитаНГФрагмент1(НомерДопРеквизита);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДопРеквизитаНГФрагмент1(Знач НомерДопРеквизита)
	
	Выполнить(" ВвестиЗначение(Объект.РеквизитВида" + НомерДопРеквизита + ", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(""Укажите значение"") + "":"");");

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДопРеквизитаНГЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	НомерДопРеквизита = ДополнительныеПараметры.НомерДопРеквизита;
	ТипДополнительногоРеквизита = ДополнительныеПараметры.ТипДополнительногоРеквизита;	
	
	ТипРеквизита = ВыбранныйЭлемент;
	Если НЕ ТипРеквизита = Неопределено Тогда
		Выполнить(" Объект.РеквизитВида" + НомерДопРеквизита + " = ПредопределенноеЗначение(""Документ."" + ТипРеквизита.Значение + "".ПустаяСсылка"");");	
	КонецЕсли;
	
	ОбработатьВыборДопРеквизитаНГФрагмент(НомерДопРеквизита);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДопРеквизитаНГФрагмент(Знач НомерДопРеквизита)
	
	Выполнить(" ВвестиЗначение(Объект.РеквизитВида" + НомерДопРеквизита + ", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(""Укажите значение"") + "":"");");

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОчисткуДопРеквизитаНГ(Знач НомерДопРеквизита = "1", СтандартнаяОбработка)	
	
	ТипДополнительногоРеквизита = Неопределено;
	Выполнить(" ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(РеквизитВида" + НомерДопРеквизита + ", ""ТипДополнительногоРеквизита"");");
	
	Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника")
		ИЛИ ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
		
		СтандартнаяОбработка = ЛОЖЬ;
		
		Выполнить(" Объект.РеквизитВида" + НомерДопРеквизита + " = Неопределено;");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("2", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("3", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида4НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("4", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида5НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("5", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида6НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("6", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида7НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("7", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида8НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("8", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида9НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("9", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида10НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборДопРеквизитаНГ("10", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида2Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("2", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида3Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("3", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида4Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("4", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида5Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("5", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида6Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("6", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида7Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("7", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида8Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("8", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида9Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("9", СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВида10Очистка(Элемент, СтандартнаяОбработка)
	ОбработатьОчисткуДопРеквизитаНГ("10", СтандартнаяОбработка);
КонецПроцедуры
